<?php /* Template Name: Разработка */ ?>
<?php
/**
 * The template for displaying all pages
 *
 * This is the template that displays all pages by default.
 * Please note that this is the WordPress construct of pages
 * and that other 'pages' on your WordPress site may use a
 * different template.
 *
 * @link https://developer.wordpress.org/themes/basics/template-hierarchy/
 *
 * @package izmerenie
 */

get_header();
$post_id = get_the_ID();
?>
<main id="main" class="main">
    <section class="maintenance">
        <div class="maintenance__decoration">
            <img class="maintenance__decoration-left mouse-parallax-bg" data-xset="30" data-yset="30" src="<?php echo get_template_directory_uri(); ?>/img/maintenance/left.svg" alt="logo">
            <img class="maintenance__decoration-right mouse-parallax-bg" data-xset="12" data-yset="12" src="<?php echo get_template_directory_uri(); ?>/img/maintenance/right.svg" alt="logo">
            <img class="maintenance__decoration-rl" src="<?php echo get_template_directory_uri(); ?>/img/maintenance/ring-left.svg" alt="logo">
            <img class="maintenance__decoration-rr" src="<?php echo get_template_directory_uri(); ?>/img/maintenance/ring-right.svg" alt="logo">
        </div>
        <div class="maintenance__container">
            <div class="maintenance__logo">
                <img class="logo-img" src="<?php echo get_template_directory_uri(); ?>/img/maintenance/logo.svg" alt="logo">
            </div>
            <h1 class="maintenance__title">
                <?php echo the_field("zagolovok", $post_id); ?>
            </h1>
            <div class="maintenance__text" data-aos="fade-up" data-aos-delay="2200">
                <?php echo the_field("tekst_pod_zagolovkom", $post_id); ?>
            </div>
            <div class="maintenance__center">
                <div class="maintenance__up" data-aos="fade-right" data-aos-delay="2700">
                    <svg width="166" height="36" viewBox="0 0 166 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M12.4119 12.0182L3.27729 12.0182L3.27729 2.40363L20.8438 2.40363L20.8438 -2.37891e-05L0.23242 -2.28882e-05L0.232422 28.8438L11.7092 28.8438C15.2225 28.8438 17.799 28.1227 19.6727 26.6805C21.5465 25.2383 22.4834 23.0751 22.4834 20.1907C22.4834 17.5467 21.5465 15.3834 19.907 14.1815C18.2674 12.7393 15.691 12.0182 12.4119 12.0182ZM17.5648 24.7576C16.1594 25.7191 14.2857 26.1998 11.7092 26.1998L3.27729 26.1998L3.27729 14.1815L11.7092 14.1815C14.2857 14.1815 16.3936 14.6623 17.5647 15.6237C18.9701 16.5852 19.4385 18.0274 19.4385 19.9503C19.6727 22.354 18.9701 23.7962 17.5648 24.7576ZM45.9698 19.5374L35.7714 -2.06269e-05L32.372 -2.04783e-05L44.27 22.4318L43.5416 23.8791C42.3275 26.0499 40.6278 27.0147 38.928 27.0147C38.1996 27.0147 37.2283 26.7735 36.257 26.5323L35.2858 28.9443C36.4999 29.4267 37.714 29.6679 38.928 29.6679C40.3849 29.6679 41.8419 29.1855 43.0559 28.4619C44.27 27.7383 45.4841 26.2911 46.4554 24.6027L59.5676 -2.16671e-05L56.4109 -2.15291e-05L45.9698 19.5374ZM74.4791 2.72722e-05L93.1078 2.64579e-05L93.3378 2.64478e-05L93.3378 26.2762L97.4775 26.2762L97.4775 35.4367L94.7177 35.4367L94.7177 28.928L70.5694 28.928L70.5694 35.4367L67.8096 35.4367L67.8096 26.2762L69.1895 26.2762C70.7993 26.0352 72.1793 24.5888 72.8692 21.696C73.5592 18.8032 74.0191 14.7051 74.2491 9.40161L74.4791 2.72722e-05ZM73.3292 26.2762L90.348 26.2762L90.348 2.65175L77.0089 2.65175L76.7789 9.64267C76.7789 13.9819 76.319 17.5979 75.859 20.4906C75.399 23.3834 74.4791 25.312 73.3292 26.2762ZM114.638 15.3834L129.666 15.3834L129.666 12.7393L114.638 12.7393L114.638 2.64399L131.605 2.644L131.605 -2.4816e-05L111.487 -2.39366e-05L111.487 28.8438L132.09 28.8438L132.09 26.1998L114.638 26.1998L114.638 15.3834ZM152.438 2.64403L142.803 2.64403L142.803 1.28415e-05L165.054 1.18689e-05L165.054 2.64403L155.19 2.64403L155.19 28.8439L152.438 28.8439L152.438 2.64403Z" fill="#15223D"/>
                    </svg>

<!--                    --><?php //echo the_field("tekst_nad_vov", $post_id); ?>
                </div>
                <div class="maintenance__wow" data-aos="fade-up" data-aos-delay="2500">
                    <svg width="591" height="153" viewBox="0 0 591 153" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M311.073 15.2579C304.521 10.4602 297.97 6.86194 290.227 4.46308C283.08 2.06422 275.338 0.864796 267.595 0.864796C258.066 0.864796 248.536 2.66394 239.602 6.26222C230.669 9.86051 222.926 15.2579 215.779 22.4545C208.632 29.6511 203.272 37.4474 199.698 46.4431C196.125 55.4388 194.338 65.6339 194.338 76.4288C194.338 87.2236 196.125 96.819 199.698 106.414C203.272 115.41 208.632 123.806 215.779 131.003C222.926 138.199 230.669 143.597 239.602 147.195C248.536 150.793 258.066 152.592 267.595 152.592C277.72 152.592 286.654 150.793 295.588 147.195C304.522 143.597 312.264 138.199 319.411 131.003C326.558 123.806 331.919 116.01 335.492 107.014C339.066 98.0185 340.852 87.8233 340.852 77.0285C340.852 64.4345 338.47 53.0399 333.11 42.2451C327.749 31.4502 320.602 22.4545 311.073 15.2579ZM299.757 124.406C291.419 136.4 280.698 142.997 267.595 142.997C254.492 142.997 243.772 137 235.433 124.406C227.095 112.412 222.926 96.2193 222.926 76.4288C222.926 56.6382 227.095 40.4459 235.433 28.4516C243.772 16.4574 254.492 9.86051 267.595 9.86051C280.698 9.86051 291.419 15.8576 299.757 28.4516C308.095 40.4459 312.264 56.6382 312.264 76.4288C312.264 96.2193 308.095 112.412 299.757 124.406Z" fill="#15223D"/>
                        <path d="M126.442 102.816L88.3248 4.46241H60.3322L83.56 62.035L67.4792 104.015L28.766 4.46241H0.773438L60.3322 151.992L89.5159 75.2287L119.891 151.992L176.472 4.46241H162.773L126.442 102.816Z" fill="#15223D"/>
                        <path d="M483.794 102.816L445.081 4.46241H417.684L440.912 62.035L424.831 104.015L386.118 4.46241H358.125L417.684 151.992L446.272 75.2287L476.647 151.992L533.823 4.46241H520.125L483.794 102.816Z" fill="#15223D"/>
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M575.514 119.608L567.176 28.4516C566.878 27.2522 566.729 26.0528 566.58 24.8534C566.431 23.6539 566.282 22.4545 565.985 21.2551V15.8576C565.985 11.0599 567.176 6.86194 568.962 4.46308C570.749 2.06422 573.727 0.864796 577.896 0.864796C582.065 0.864796 584.448 2.66394 586.83 5.06279C588.617 7.46165 589.808 11.0599 589.808 15.8576C589.808 16.3223 589.719 16.877 589.609 17.5566C589.436 18.6312 589.213 20.0179 589.213 21.8548C589.213 23.1403 589.041 24.4259 588.883 25.6191C588.745 26.6525 588.617 27.6166 588.617 28.4516L580.279 119.608H575.514ZM578.492 126.807C582.065 126.807 585.043 128.007 587.426 130.406C589.808 132.805 590.999 135.803 590.999 139.401C590.999 143 589.808 145.998 587.426 148.397C585.043 150.796 582.065 151.995 578.492 151.995C574.918 151.995 571.94 150.796 569.558 148.397C567.176 145.998 565.984 143 565.984 139.401C565.984 135.803 567.176 132.805 569.558 130.406C571.94 128.007 574.918 126.807 578.492 126.807Z" fill="#15223D"/>
                    </svg>

<!--                    --><?php //echo the_field("tekst_wow", $post_id); ?>
                </div>
            </div>
            <div class="maintenance__btn form__js" data-aos="fade-up" data-aos-delay="3000">
                <span><?php echo the_field("nadpis_na_knopke", $post_id); ?></span>
                <svg width="26" height="8" viewBox="0 0 26 8" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path fill-rule="evenodd" clip-rule="evenodd" d="M22.1716 0.46444L25.3536 3.64642C25.5488 3.84168 25.5488 4.15826 25.3536 4.35353L22.1716 7.53551C21.9763 7.73077 21.6597 7.73077 21.4645 7.53551C21.2692 7.34025 21.2692 7.02366 21.4645 6.8284L23.7929 4.49997H0V3.49997H23.7929L21.4645 1.17155C21.2692 0.976284 21.2692 0.659702 21.4645 0.46444C21.6597 0.269178 21.9763 0.269178 22.1716 0.46444Z" fill="white"/>
                </svg>
            </div>
            <div class="maintenance__socials" data-aos="fade-up" data-aos-delay="3200">
                <?php
                if( have_rows('soczialnye_seti', $post_id) ):
                    while( have_rows('soczialnye_seti', $post_id) ) : the_row();
                        $sub_title = get_sub_field('nazvanie_soczialnoj_seti');
                        $sub_src = get_sub_field('ssylka_na_soczialnuyu_set');
                        ?>
                        <a href="<?php echo $sub_src; ?>" class="maintenance__socials-item">
                            <?php echo $sub_title; ?>
                        </a>
                    <?php
                    endwhile;
                endif;
                ?>
            </div>
            <div class="maintenance__copyright">
                © 2023. Subareva Clinic
            </div>
        </div>
    </section>
    <section class="fade">
        <div class="fade__container" style="display: none">
            <div class="fade__close">
                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M0.707107 2.12129C0.316583 1.73077 0.316583 1.0976 0.707107 0.707078C1.09763 0.316554 1.7308 0.316554 2.12132 0.707078L23.3345 21.9203C23.725 22.3108 23.725 22.944 23.3345 23.3345C22.944 23.725 22.3108 23.725 21.9203 23.3345L0.707107 2.12129Z" fill="#A9B3C0"/>
                    <path d="M2.12117 23.3345C1.73065 23.725 1.09748 23.725 0.706956 23.3345C0.316431 22.944 0.316431 22.3108 0.706956 21.9203L21.9202 0.707101C22.3107 0.316577 22.9438 0.316576 23.3344 0.707101C23.7249 1.09762 23.7249 1.73079 23.3344 2.12131L2.12117 23.3345Z" fill="#A9B3C0"/>
                </svg>
            </div>
            <p class="fade__title">
                Что бы записаться на консультацию, вы можете связаться с нами по указанным ниже контактам, или оставить свои данные и наши администраторы перезвонят вам для согласования времени
            </p>
            <div class="fade__contacts">
                <div class="fade__contacts-column">
                    <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M18 28.5C14.475 25.9 11.8435 23.375 10.1055 20.925C8.3685 18.475 7.5 16.075 7.5 13.725C7.5 11.95 7.819 10.3935 8.457 9.0555C9.094 7.7185 9.9125 6.6 10.9125 5.7C11.9125 4.8 13.0375 4.125 14.2875 3.675C15.5375 3.225 16.775 3 18 3C19.225 3 20.4625 3.225 21.7125 3.675C22.9625 4.125 24.0875 4.8 25.0875 5.7C26.0875 6.6 26.9065 7.7185 27.5445 9.0555C28.1815 10.3935 28.5 11.95 28.5 13.725C28.5 16.075 27.631 18.475 25.893 20.925C24.156 23.375 21.525 25.9 18 28.5ZM18 16.5C18.825 16.5 19.5315 16.206 20.1195 15.618C20.7065 15.031 21 14.325 21 13.5C21 12.675 20.7065 11.9685 20.1195 11.3805C19.5315 10.7935 18.825 10.5 18 10.5C17.175 10.5 16.469 10.7935 15.882 11.3805C15.294 11.9685 15 12.675 15 13.5C15 14.325 15.294 15.031 15.882 15.618C16.469 16.206 17.175 16.5 18 16.5ZM7.5 33V30H28.5V33H7.5Z" fill="#A9B3C0"/>
                    </svg>
                    <span class="fade__contacts-item">ул. Канатная, 122 Б</span>
                    <span class="fade__contacts-item">Фонтанская дорога, 6 А</span>
                    <span class="fade__contacts-item">ул. Львовская, 15 Б</span>
                </div>
                <div class="fade__contacts-column">
                    <svg width="36" height="36" viewBox="0 0 36 36" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M22.5 18H25.5C25.5 16.0109 24.7098 14.1032 23.3033 12.6967C21.8968 11.2902 19.9891 10.5 18 10.5V13.5C19.1935 13.5 20.3381 13.9741 21.182 14.818C22.0259 15.6619 22.5 16.8065 22.5 18ZM28.5 18H31.5C31.5 10.5 25.455 4.5 18 4.5V7.5C23.79 7.5 28.5 12.195 28.5 18ZM30 23.25C28.125 23.25 26.325 22.95 24.645 22.395C24.12 22.23 23.535 22.35 23.115 22.77L19.815 26.07C15.56 23.8999 12.1001 20.44 9.93 16.185L13.23 12.885C13.65 12.465 13.77 11.88 13.605 11.355C13.036 9.62708 12.7473 7.8192 12.75 6C12.75 5.60218 12.592 5.22064 12.3107 4.93934C12.0294 4.65804 11.6478 4.5 11.25 4.5H6C5.60218 4.5 5.22064 4.65804 4.93934 4.93934C4.65804 5.22064 4.5 5.60218 4.5 6C4.5 12.763 7.1866 19.249 11.9688 24.0312C16.751 28.8134 23.237 31.5 30 31.5C30.3978 31.5 30.7794 31.342 31.0607 31.0607C31.342 30.7794 31.5 30.3978 31.5 30V24.75C31.5 24.3522 31.342 23.9706 31.0607 23.6893C30.7794 23.408 30.3978 23.25 30 23.25Z" fill="#A9B3C0"/>
                    </svg>
                    <a  class="fade__contacts-item" href="tel:+38 096 13 97 093">+38 096 13 97 093</a>
                    <a  class="fade__contacts-item" href="tel:+380 66 662 36 81">+380 66 662 36 81</a>
                    <p class="desc">(Viber, Telegram)</p>
                </div>
            </div>
            <div class="fade__form">
                <?php echo do_shortcode( '[contact-form-7 id="5" title="Форма страницы разработки"]' );?>
            </div>
        </div>
    </section>
</main>

<?php wp_footer(); ?>
</body>
</html>